// Part of MeasurementKit <https://measurement-kit.github.io/>.
// MeasurementKit is free software. See AUTHORS and LICENSE for more
// information on the copying conditions.
"app_name" = "OONI Probe";

"run_tests" = "Run Tests";
"past_tests" = "Past Tests";
"settings" = "Ayarlar";
"about" = "Hakkında";

"dns_injection" = "DNS Injection";
"tcp_connect" = "TCP Connect";
"http_invalid_request_line" = "HTTP Invalid request line";
"http_header_field_manipulation" = "HTTP Header field manipulation";
"web_connectivity" = "Web Connectivity";
"ndt" = "NDT Speed Test";
"dash" = "DASH Streaming Test";
"whatsapp" = "WhatsApp";
"telegram" = "Telegram";
"facebook_messenger" = "Facebook Messenger";

"web_connectivity_desc" = "Check if websites are blocked";
"http_invalid_request_line_desc" = "Find 'middle boxes'";
"http_header_field_manipulation_desc" = "Find 'middle boxes'";
"ndt_desc" = "Measure network speed and performance";
"dash_desc" = "Measures video streaming quality";
"whatsapp_desc" = "Check if WhatsApp is blocked";
"telegram_desc" = "Check if Telegram is blocked";
"facebook_messenger_desc" = "Check if Facebook Messenger is blocked";

"web_connectivity_longdesc" = "This test examines whether access to websites is blocked through DNS tampering, TCP/IP blocking, or by a transparent HTTP proxy.\n\nEvery time you run Web Connectivity you test different websites.";
"http_invalid_request_line_longdesc" = "This test tries to detect systems (“middle boxes”) that could be responsible for censorship or surveillance by sending an invalid HTTP request line to an echo service. If such systems are in your network, the invalid HTTP request line will be intercepted and may trigger an error.";
"http_header_field_manipulation_longdesc" = "This test tries to detect the presence of systems (“middle boxes”) that could be responsible for censorship or surveillance by sending HTTP requests with non-canonical headers to a backend control server. If such systems are in your network, they will likely normalize the headers or add extra headers.";
"ndt_longdesc" = "This test measures the speed and performance of your network.\n\nDisclaimer: This is a third-party performance test based on third-party servers, and we cannot guarantee that your IP address will not be collected, processed, and published.";
"dash_longdesc" = "This test emulates a very simple video player streaming at variable quality from a remote server. The test is designed to obtain a baseline performance of your network for performing video streaming.\n\n Disclaimer: This is a third-party performance test based on third-party servers, and we cannot guarantee that your IP address will not be collected, processed, and published.";
"whatsapp_longdesc" = "This test is designed to examine the reachability of both WhatsApp's app and the WhatsApp web version within a tested network.";
"telegram_longdesc" = "This test is designed to examine the reachability of Telegram's app and web version within a tested network.";
"facebook_messenger_longdesc" = "This test is designed to examine the reachability of Facebook Messenger within a tested network.";

"running_tests" = "Running tests";
"finished_tests" = "Finished tests";

"settings" = "Ayarlar";
"collector_address" = "Collector Address";

"cancel" = "İptal";
"ok" = "Tamam";
"delete" = "Sil";

"test_result" = "Test result";
"change" = "Change";

"welcome_ooniprobe" = "Welcome to OONI Probe!";
"get_started" = "Get Started!";

"what_is_ooniprobe" = "What is OONI Probe?";
"learn_more" = "Daha fazla bilgi";

"risks_text_1" = "OONI Probe is free and open source software that enables you to examine internet censorship in your network!";
"risks_text_2" = "By running this app, you can examine whether and how websites are blocked, and whether censorship and/or surveillance systems are present in your network.";
"risks_text_3" = "You can also run this app to measure the speed and performance of your network.";
"risks_text_4" = "The data that you can collect through this app can serve as evidence of censorship events .";
"risks_text_5" = "Since OONI Probe is an investigatory tool and as such, may pose some risks.";

"potential_risks" = "Potential risks";
"laws_text_1" = "Anyone monitoring your internet activity (e.g. ISP, government, employer) can know that you are running OONI Probe (even though OONI tries to make this hard).";
"laws_text_2" = "When testing websites for censorship, you will connect to and download data from provocative or objectionable sites (e.g. pornography) that might be illegal in your country.";
"laws_text_3" = "OONI’s HTTP invalid request line test might trigger the suspicion of your ISP and could be viewed as a form of “hacking”.";
"laws_text_4" = "Unless you configure your settings otherwise, all data collected from your tests will by default be published by OONI and might include some personally- identifiable information (though OONI tries to prevent this from happening).";
"laws_text_5" = "The mere use of OONI Probe might be viewed as a form of espionage, regardless of the laws in your country.";
"laws_text_6" = "To our knowledge, no OONI Probe user has ever faced consequences from the use of our platform. However, many countries have a lengthy history of targeting and abusing digital rights activists, which could leave OONI Probe users subject to severe civil, criminal, or extra-judicial penalties.";
"i_understand_the_risks" = "I understand the risks.";

"pop_quiz" = "Pop Quiz!";
"question_1" = "Question 1: Might anyone monitoring my internet activity (e.g. ISP, government or employer) be able to see that I am running OONI Probe, even though OONI takes precautions to make this hard?";
"question_2" = "Question 2: Will my measurements by default get published by OONI and might they include personally-identifiable information?";
"true" = "True";
"false" = "False";
"how_did_i_do" = "How did I do?";

"wrong" = "A little bit more reading is required for you to proceed.";
"correct" = "Good job! You have answered the quiz correctly.";

"set_up_sharing" = "Setup Sharing";
"include_ip" = "IP adresini kapsasın mı?";
"include_asn" = "Include your network info?";
"include_cc" = "Ülkenin ismini dahil etsin mi?";
"upload_results" = "Sonuçları herkese açık olarak paylaş?";
"settings_text" = "All measurements are sent by default to OONI's measurement collector and automately published through the OONI explorer and OONI's list of measurements.";
"im_all_set" = "I'm all set!";
"ooniprobe_configured" ="Successfully configured OONI Probe. You are all set to go!";

"about_ooni" = "OONI Hakkında";
"about_text_1" = "The Open Observatory of Network Interference (OONI) is a free software project under The Tor Project that aims to increase transparency of internet censorship around the world.";
"about_text_2" ="Since 2012, OONI has collected millions of network measurements from around the world, shedding light on multiple instances of internet censorship and traffic manipulation.";
"learn_more" = "Daha fazla bilgi";

"run" = "Run";
"view" = "Göster";

"no_result" = "No results";
"no_result_msg" = "The test has no results or it was aborted";

"local_notifications" = "Run test reminder";
"local_notifications_time" = "Zaman";
"local_notifications_text" = "Time to run tests";

"notifications" = "Bildirimler";

"max_runtime" = "Web Connectivity max runtime (seconds)";
"advanced_settings" = "Advanced settings";
"finished_running" = "%@ finished running";
"view_log" = "View log";
"copy_to_clipboard" = "Copy to clipboard";
"copied_clipboard" = "Copied into clipboard";
"send_crash" = "Send crash reports";
"privacy" = "Kişisel Gizlilik";
"view_data_policy" = "Click here to view our data policy";
"test_name_finished" = "%@ finished, go to Past Tests to see the results";
"open_url_alert" = "Do you want to open the following URL?";
"max_runtime_low" = "The max runtime you have entered is too low, setting to default.";
"clear_all_tests_alert" = "Do you want to delete all test results?";
"past_tests_empty" = "Past test results will appear here once the tests have finished running";

"try_mirror" = "Try mirror";
"loading" = "Loading...";
"set_default" = "Set default";

"run_test_message" = "You are about to run an OONI Probe test on your network";
"urls" = "URLs";
"test_name" = "Test name";
"test_details" = "Test Details";
"ooniprobe_outdate" = "OONI Probe is out of date";
"ooniprobe_outdate_msg" = "In order to run this test you need a newer version of OONI Probe, click on the button below to update";
"invalid_parameter" = "Invalid parameter";
"random_sampling_urls" = "A random sampling of URLs from the global list";

"websites" = "Web siteleri";
"instant_messaging" = "Instant Messaging";
"middle_boxes" = "Middle Boxes";
"performance" = "Performance";
